Revit 2027 API
FamilyInstancePlacingArgs.TooltipMessage Property
 The message to be shown via tooltip
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string TooltipMessage { get; set; }
Public Property TooltipMessage As String
	Get
	Set
public:
property String^ TooltipMessage {
	String^ get ();
	void set (String^ value);
}
member TooltipMessage : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FamilyInstancePlacingArgs Class
Autodesk.Revit.UI Namespace